Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: A Boolean value indicating whether this decimal is NaN.
ja: この10進数がNaNであるかどうかを指し示しているブール値。

source: A Boolean value indicating whether this decimal is a signaling NaN.
ja: この10進数がsignaling NaNであるかどうかを指し示すブール値。

source: A Boolean value indicating whether this decimal is infinity.
ja: この10進数が無限大であるかどうかを指し示しているブール値。

source: A Boolean value indicating whether this decimal is normal (not zero, subnormal, infinity, or NaN).
ja: この10進数が正規化数である（ゼロ、非正規化数、無限大またはNaN（非数）でない）かどうかを指し示しているブール値。

source: A Boolean value indicating whether this decimal is subnormal.
ja: この10進数が非正規化数であるかどうかを指し示しているブール値。

source: A Boolean value indicating whether this decimal is zero, subnormal, or normal (not infinity or NaN).
ja: この10進数がゼロ、非正規化数、正規化数である（無限大またはNaN（非数）でない）かどうかを指し示しているブール値。

source: A Boolean value indicating whether this value is zero.
ja: この値がゼロであるかどうかを指し示すブール値。

source: A Boolean value indicating whether to collapse the largest unit into smaller units when a certain threshold is met.
ja: 特定の閾値に達する場合に最も大きい単位をより小さい単位へ折りたたむかどうかを指し示すブール値。

source: A Boolean value that indicates whether a custom accessibility object sends a notification when its corresponding UI element is destroyed.
ja: あるあつらえのアクセシビリティオブジェクトが、それの対応UI要素が破棄された時に通知を送ったかどうかを指し示すブール値。

source: A Boolean value that indicates whether the energy value is used to measure food energy.
ja: エネルギー値が食物エネルギーを測定するために使われるかどうかを指し示すブール値。

source: A Boolean value that indicates whether the receiver has bytes available to read.
ja: 読み出しに利用可能なバイトをレシーバが持つかどうかを指し示すブール値。

source: A Boolean value that indicates whether the receiver uses heuristics when parsing a string.
ja: 文字列を構文解析するときレシーバが発見的手法を使うかどうかを指し示すブール値。

source: A Boolean value that indicates whether the receiver uses phrases such as “today” and “tomorrow” for the date component.
ja: レシーバが語句、例えば “today” や “tomorrow” を日付構成要素に対して使うかどうかを指し示すブール値。

source: A Boolean value that indicates whether the receiver's script has been compiled.
ja: ブール値、それはレシーバの持つスクリプトがコンパイルされているかどうかを指し示します。

source: A Boolean value that indicates whether the set has no elements.
ja: 集合が要素をひとつも持たないかどうかを指し示すブール値。

source: A C array of objects of size at least the length of the range specified by a Range.
ja: オブジェクト（objects）のC配列、少なくともa Rangeによって指定された範囲の長さの大きさ。

source: A C array of objects.
ja: オブジェクトのC配列。

source: A C string representation of a pathname.
ja: あるパス名のC文字列表現。

source: A C-string representation of path that properly encodes Unicode strings for use by the file system.
ja: pathのC文字列表現、それはファイルシステムによって使うためのユニコード文字列を適切にエンコードするものです。

source: A URL indicating the location of the group's shared directory in the file system.
ja: ファイルシステムにおいてグループの持つ共有ディレクトリの位置を指し示すURL。

source: A URL load request that is independent of protocol or URL scheme.
ja: URLロード要請、それはプロトコルまたはURLスキームから独立しています。

source: A URL object containing the location of the specified user’s home directory, or nil if no such user exists or the user’s home directory is not available.
ja: 指定されたユーザのホームディレクトリの場所を含んでいるURLオブジェクト、またはnil、もしそのようなユーザが存在しないまたはユーザのホームディレクトリが利用可能でないならば。

source: A URL pointing to the specified ubiquity container, or nil if the container could not be located or if iCloud storage is unavailable for the current user or device.
ja: 指定される偏在コンテナを指しているURL、もしくはコンテナが位置を突き止められないならばまたはiCloudストレージが現在のユーザまたはデバイスに利用可能でないならばnil。

source: A URL that locates a script, in either text or compiled form.
ja: あるスクリプトを位置決めするURL、テキストまたはコンパイル済み形式のどちらかで。

source: A URL with which users can download a copy of the item at url.
ja: それでユーザがurlでの項目のコピーをダウンロードできるURL。

source: A Unicode string value that is a collection of characters.
ja: ユニコード文字列値で、いくらかの文字からなる１つのコレクションです。

source: A bit mask that specifies the options for the enumeration (whether it should be performed concurrently and whether it should be performed in reverse order).
ja: あるビットマスク、それは、列挙のためのオプションを指定します（それが並行に実行されるべきかどうかそしてそれが逆順に実行されるべきかどうか）。

source: A bit mask that specifies the options for the sort (whether it should be performed concurrently and whether it should be performed stably).
ja: あるビットマスク、それはソートのためのオプションを指定します（それが並行に実行されるべきかどうかそしてそれが安定に実行されるべきかどうか）。

source: A block that is called on an anonymous background queue.
ja: 匿名バックグラウンドキュー上で呼び出されるブロック。

source: A boolean that indicates whether the file wrapper object is a symbolic-link file wrapper.
ja: ブール値、それはファイルラッパーオブジェクトがシンボリックリンクファイルラッパーかどうかを指し示します。

source: A boolean value that indicates whether the receiver should be discarded at the end of the session (regardless of expiration date).
ja: レシーバがセッションの終わりで（有効期限にかかわらず）廃棄されるべきかどうかを指し示すブール値。

source: A boolean value that indicates whether the receiver should only be sent to HTTP servers per RFC 2965.
ja: レシーバがHTTPサーバにRFC 2965によってのみ送られるべきかどうかを指し示すブール値。

source: A boolean value that indicates whether this cookie should only be sent over secure channels.
ja: このクッキーが安全な経路越しにのみ送られるべきかどうかを指し示すブール値。

source: A brief description of the result of performing an action on the accessibility element, in a localized string.
ja: ローカライズされた文字列での、アクセシビリティ要素上であるアクションを実行する結果の短い説明。

source: A buffer into which to store the bytes from the receiver.
ja: それの中にレシーバからのバイトを格納することになるバッファ。

source: A buffer pointer to copy.
ja: コピーするバッファポインタ。

source: A buffer to copy the data into.
ja: データをそれへとコピーすることになる、あるバッファ。

source: A byte buffer in memory.
ja: メモリの中のあるバイトバッファ。

source: A cached response to a URL request.
ja: URLリクエストに対するキャッシュされた応答。

source: A calendar component.
ja: あるカレンダー構成要素。

source: A calendar that tracks changes to user’s preferred calendar.
ja: ユーザの持つ優先カレンダーに対する変更を追跡するカレンダー。

source: A capitalized representation of the string.
ja: 語頭を大文字にした表現の文字列。

source: A capitalized string is a string with the first character in each word changed to its corresponding uppercase value, and all remaining characters set to their corresponding lowercase values.
ja: 語頭を大文字にした文字列は、各単語において最初の文字をそれの対応している大文字値へ変更した、そしてすべての残りの文字をそれらの対応している子文字値へ設定した文字列です。

source: A capture group consists of each possible match within a regular expression.
ja: 捕獲グループは、正規表現の範囲内で可能なマッチそれぞれから成ります。

source: A category +load method is called after the class’s own +load method.
ja: あるカテゴリ+loadメソッドは、そのクラス自身の+loadメソッドの後に呼び出されます。

source: A class also conforms to any protocols that are incorporated in the protocols it adopts or inherits.
ja: あるクラスはまた、それが採用または継承するプロトコルの中に取り入れられるどんなプロトコルにも準拠します。

source: A class is said to “conform to” a protocol if it adopts the protocol or inherits from another class that adopts it.
ja: あるクラスがあるプロトコルに準拠すると言われるのは、それがそのプロトコルを採用するまたはそれを採用する別のクラスから継承する場合です。

source: A class object.
ja: あるクラスオブジェクト。

source: A class’s +load method is called after all of its superclasses’ +load methods.
ja: あるクラスの持つ+loadメソッドは、それのスーパークラスの+loadメソッド全ての後に呼び出されます。

source: A closure that accepts an element of this sequence as its argument and returns an optional value.
ja: あるクロージャ、それはこのシーケンスのひとつの要素をそれの引数として受け取って、ひとつのオプショナルの値を返すものです。

source: A closure that combines an accumulating value and an element of the sequence into a new accumulating value, to be used in the next call of the next Partial Result closure or returned to the caller.
ja: あるクロージャ、それはある蓄積値とシーケンスのある要素を新しい蓄積値へと結合して、next Partial Resultクロージャの次の呼び出しにおいて使われるか呼び出し側に返されるようにします。

source: A closure that is called with search results.
ja: 検索結果とともに呼び出されるクロージャ。

source: A closure that takes an element as an argument and returns a Boolean value indicating whether the collection should be split at that element.
ja: あるクロージャ、それは１つの要素を引数として取り、コレクションがその要素で分割されるかどうかを指し示すブール値を返します。

source: A closure that takes an element as its argument and returns a Boolean value that indicates whether the passed element represents a match.
ja: あるクロージャ、それは１つの要素をそれの引数として取り、渡された要素が合致するものであるかどうかを指し示すブール値を返します。

source: A closure that takes an element of the sequence as a parameter.
ja: あるクロージャ、それはシーケンスの１要素を引数として取ります。

source: A closure that takes an element of the sequence as its argument and returns true if the element should be included or false if it should be excluded.
ja: あるクロージャ、それはシーケンスの１つの要素をそれの引数として取り、その要素が含まれるべきならばtrueをまたはそれが除外されるべきならばfalseを返します。

source: A closure that takes an element of the sequence as its argument and returns true if the element should be skipped or false if it should be included.
ja: あるクロージャ、それはシーケンスの１つの要素をそれの引数として取り、その要素が省かれるべきならばtrueをまたはそれが含まれるべきならばfalseを返します。

source: A closure that takes an element of the sequence as its argument and returns a Boolean value indicating whether the element is a match.
ja: あるクロージャ、それは１つの要素をそれの引数として取り、その要素が合致するものかどうかを指し示しているブール値を返します。

source: A closure that takes an element of the sequence as its argument and returns a Boolean value indicating whether the element should be included in the returned array.
ja: あるクロージャ、それは１つの要素をそれの引数として取り、その要素が返される配列に含まれるべきかどうかを指し示しているブール値を返します。

source: A closure that takes an element of the sequence as its argument and returns a Boolean value that indicates whether the passed element represents a match.
ja: あるクロージャ、それはこのシーケンスの１つの要素をそれの引数として取り、渡された要素が合致するものであるかどうかを指し示すブール値を返します。

source: A closure that updates the accumulating value with an element of the sequence.
ja: 蓄積される値をこのシーケンスのある要素を使って更新するクロージャ。

source: A coder object that can only encode values is referred to as an encoder object, and one that can only decode values as a decoder object.
ja: コーダーオブジェクトで、値のエンコードだけができるものはエンコーダオブジェクト、値のデコードだけができるものはデコーダオブジェクトと呼ばれます。

source: A coder that stores an object's data to an archive referenced by keys.
ja: あるオブジェクトの持つデータをキーによって参照されるアーカイブに格納するコーダ。

source: A coder that stores an object's data to an archive.
ja: オブジェクトの持つデータをアーカイブに格納するコーダ。

source: A collection of default comparison methods useful for performing specifier tests.
ja: 指定子テストを実行するのに有用な省略時の比較メソッドのいちコレクション。

source: A collection of methods providing additional object specifier functionality.
ja: 追加のオブジェクト指定子機能を提供するいちコレクション。

source: A collection of methods that provide additional capabilities for working with key-value coding.
ja: キー値コーディングを扱うための追加能力を提供するメソッドのいちコレクション。

source: A collection of methods useful for comparing script objects.
ja: スクリプトオブジェクトを比較するために有用なメソッドのいちコレクション。

source: A collection of unique integer values that represent the indexes of elements in another collection.
ja: 別のコレクションの中の要素のインデックスを表す特有の整数値からなるコレクション。

source: A collection similar to a dictionary, but with a broader range of available memory semantics.
ja: 辞書に似たコレクション、しかしより幅広い範囲の利用可能なメモリ意味論を持ちます。

source: A collection similar to a set, but with broader range of available memory semantics.
ja: 集合に似たコレクション、しかしより幅広い範囲の利用可能なメモリ意味論を持ちます。

source: A collection similar to an array, but with a broader range of available memory semantics.
ja: 配列に似たコレクション、しかしより幅広い範囲の利用可能なメモリ意味論を持ちます。

source: A collection whose elements are key-value pairs.
ja: それの要素がキー値ペアであるコレクション。

source: A collection’s indices property can hold a strong reference to the collection itself, causing the collection to be non-uniquely referenced.
ja: あるコレクションのindicesプロパティは、そのコレクション自身に対する強い参照を保持でき、そのコレクションが特有にでなくとも参照されるようにします。

source: A combination of NSKey Value Observing Options values that specifies what is included in observation notifications.
ja: 監視通知に何が含まれるかを指定するNSKey Value Observing Options値の組み合わせ。

source: A combination of the NSKey Value Observing Options values that specifies what is included in observation notifications.
ja: 監視通知に何が含まれるかを指定するNSKey Value Observing Options値の組み合わせ。

source: A comma-separated list of additional objects, ending with nil.
ja: nilで終わる、コンマで区切られた追加オブジェクトのリスト。

source: A command that clones one or more scriptable objects.
ja: ひとつ以上のスクリプト対応オブジェクトをクローンするコマンド。

source: A command that closes one or more scriptable objects.
ja: ひとつ以上のスクリプト対応オブジェクトを閉じるコマンド。

source: A command that counts the number of objects of a specified class in the specified object container.
ja: 指定されたクラスのオブジェクトの数を、指定されたオブジェクトコンテナの中で数えるコマンド。

source: A command that creates a scriptable object.
ja: スクリプト対応オブジェクトを作成するコマンド。

source: A command that deletes a scriptable object.
ja: あるスクリプト対応オブジェクトを削除するコマンド。

source: A command that determines whether a scriptable object exists.
ja: あるスクリプト対応オブジェクトが存在するかどうかを判定するコマンド。

source: A command that moves one or more scriptable objects.
ja: ひとつ以上のスクリプト対応オブジェクトを移動するコマンド。

source: A command that quits the specified app.
ja: 指定されたアプリを終了するコマンド。

source: A command that retrieves a value or object from a scriptable object.
ja: スクリプト対応オブジェクトから値またはオブジェクトを取ってくるコマンド。

source: A command that sets one or more attributes or relationships to one or more values.
ja: ひとつ以上の属性またはリレーションシップ（関係）をひとつ以上の値に設定するコマンド。

source: A comparator block used to compare the object obj with elements in the array.
ja: 比較用ブロック、オブジェクトobjを配列の要素と比較するのに使われます。

source: A comparator block.
ja: 比較を行うブロック。

source: A comparison between an object specifier and a test object.
ja: オブジェクト指定子とテストオブジェクトとの間の比較。

source: A component to calculate a range for.
ja: それに対して範囲を計算することになるある構成要素。

source: A condition object acts as both a lock and a checkpoint in a given thread.
ja: ある条件オブジェクトは、与えられたスレッドにおいてロックとチェックポイントの両方として振舞います。

source: A constant used as a key for the user Info dictionary of a did Load Notification notification that corresponds to an array of names of each class that was loaded.
ja: ロードされたクラスそれぞれの名前の配列に対応する、あるdid Load Notification通知のuser Info辞書に対するキーとして使われるある定数。

source: A convenient interface to the garbage collection system.
ja: ガベージコレクションシステムに対する便利なインターフェイス。

source: A copy of a Rect, altered by moving the two sides that are parallel to the y axis inward by d X, and the two sides parallel to the x axis inwards by d Y.
ja: a Rectのコピーで、y軸に並行な２辺をd Xだけ内側に、そしてx軸に平行な２辺をd Yだけ内側に移動することで改変されます。

source: A copy of a Rect, expanded outward just enough to ensure that none of its four defining values (x, y, width, and height) have fractional parts.
ja: a Rectのコピー、それの４つの定義値（x、y、幅、そして高さ）のうちどれも小数部を持たないことを確実にするのにちょうど必要なだけ外側へ拡大されます。

source: A copy of a Rect, modified based on the options.
ja: a Rectのコピー、オプションに基づいて修正されます。

source: A copy of a Rect, with its location shifted by d X along the x axis and by d Y along the y axis.
ja: a Rectのコピー、それの位置は、x軸に沿ってd Xだけそしてy軸に沿ってd Yだけずらされます。

source: A copy of the receiving array sorted as specified by sort Descriptors.
ja: sort Descriptorsによって指定された通りにソートされた受け手側の配列のコピー。

source: A custom deallocator.
ja: あつらえのデアロケータ。

source: A custom formatter can restrict the input and enhance the display of data in novel ways.
ja: あつらえのフォーマッタは、入力を制限して、データの表示を斬新な方法で向上します。

source: A custom playground Quick Look for the date.
ja: 日付のためのカスタムプレイグラウンドQuick Look。

source: A custom playground Quick Look for this object.
ja: このオブジェクトのためのあつらえのプレイグラウンドQuick Look。

source: A data buffer.
ja: あるデータバッファ。

source: A data object containing the contents of the new file.
ja: 新しいファイルの内容を含んでいるデータオブジェクト。

source: A date components object containing the date and time information to format.
ja: 書式設定する日付と時刻情報を含んでいる、日付構成要素オブジェクト。

source: A date or time specified in terms of units (such as year, month, day, hour, and minute) to be evaluated in a calendar system and time zone.
ja: あるカレンダー体系とタイムゾーンにおいて評価されるいくらかの単位（例えば年、月、日、時、そして分）に基づいて指定される日付と時刻。

source: A date representation of string interpreted using the receiver’s current settings.
ja: レシーバの現在の設定を使って解釈されるstringの日付表現。

source: A date to check for containment.
ja: 包含について調べる日付。

source: A date to compare.
ja: 比較する日付。

source: A date value representing a date in the distant future.
ja: 遠い未来のある日付を表している日付値。

source: A date value representing a date in the distant past.
ja: 遠い過去のある日付を表している日付値。

source: A date.
ja: ある日付。

source: A day or count of days.
ja: ある日または数え日。

source: A deallocator you use to customize how the backing store is deallocated for data created with the no-copy initializer.
ja: 非コピーイニシャライザで作成されたデータに対してバッキングストアがデアロケートされる方法を、あなたがカスタマイズするのに使うデアロケータ。

source: A decoder that restores data from an archive referenced by keys.
ja: キーによって参照されるアーカイブからデータを復元するデコーダ。

source: A decoder that restores data from an archive.
ja: アーカイブからデータを復元するデコーダ。

source: A definition of logical conditions used to constrain a search either for a fetch or for in-memory filtering.
ja: フェッチ（主メモリ呼び出し）またはインメモリフィルタのどちらかに対する検索に制約を加えるために使われる論理条件の定義。

source: A definition of the relationships between calendar units (such as eras, years, and weekdays) and absolute points in time, providing features for calculation and comparison of dates.
ja: カレンダー単位（例えば、紀年、年、そして曜日など）と時間の中の絶対的時点の間のそれら関係からなるある定義で、日付の計算と比較のための機能を提供しています。

source: A description of the distance between the edges of two rectangles.
ja: ２つの矩形の端の間の隔たりの記述。

source: A description of the linguistic content of natural language text, typically used for spelling and grammar checking.
ja: 一般的にスペルおよび文法チェックのために使われる、自然言語テキストの言語学的内容の記述。

source: A descriptor can store a value, or it can store a list of other descriptors (which may also be lists).
ja: 記述子は１つの値を格納することができます、またはそれは別の記述子からなる１つのリストを格納できます（リスト中の記述子もまたリストであることができます）。

source: A descriptor containing the specified integer value, or nil if an error occurs.
ja: 指定された整数値を含んでいる記述子、またはエラーが起こるならばnil。

source: A descriptor for an Apple event, initialized according to the specified parameter values, or nil if an error occurs.
ja: 指定のパラメータ値に従って初期化された、あるアップルイベントのための記述子、またはエラーが起こるならばnil。

source: A descriptor for the specified keyword, or nil if an error occurs.
ja: 指定されたキーワードに対する記述子、またはエラーが起こるならばnil。

source: A descriptor of the specified type, or nil if an error occurs.
ja: 指定された型の記述子、またはエラーが起こるならばnil。

source: A descriptor that contains the text from the specified string, or nil if an error occurs.
ja: 指定された文字列からのテキストを含む記述子、またはエラーが起こるならばnil。

source: A descriptor with no parameter or attribute values set, or nil if an error occurs.
ja: パラメータまたは属性値が設定されない記述子、またはエラーが起こるならばnil。

source: A descriptor with the specified Boolean value, or nil if an error occurs.
ja: 指定されたブール値を持つ記述子、またはエラーが起こるならばnil。

source: A descriptor with the specified enumerator data type value, or nil if an error occurs.
ja: 指定された列挙子データ型を持つ記述子、またはエラーが起こるならばnil。

source: A descriptor with the specified type and data, or nil if an error occurs.
ja: 指定された型とデータを持つ記述子、またはエラーが起こるならばnil。

source: A descriptor with the specified type, or nil if an error occurs.
ja: 指定された型を持つ記述子、またはエラーが起こるならばnil。

source: A dictionary containing all the HTTP header fields received as part of the server’s response.
ja: サーバの持つ応答の一部として受け取られる全てのHTTPヘッダフィールドを含んでいる辞書。

source: A dictionary containing as keys the attributes to set for path and as values the corresponding value for the attribute.
ja: pathに対して設定する属性をキーとして、そしてその属性に対応する値を値として含んでいる辞書。

source: A dictionary containing the attributes to associate with the new file.
ja: 新しいファイルと結び付けられる属性を含んでいる辞書。

source: A dictionary containing the components of a type checking result.
ja: 型チェック結果の構成要素を含んでいる辞書。

source: A dictionary containing the options to use when opening the nib file.
ja: nibファイルを開く時に使うオプションを含んでいる辞書。

source: A dictionary object that describes the attributes (file, directory, symlink, and so on) of the file specified by path.
ja: pathによって指定されたファイルの属性（ファイル、ディレクトリ、symlink、など）を記述する辞書オブジェクト。

source: A dictionary object that describes the attributes of the mounted file system on which path resides.
ja: ある辞書オブジェクト、それはそれにpathが居住するところのマウント済みファイルシステムの属性を記述します。

source: A dictionary of file attributes.
ja: ファイル属性の辞書。

source: A dictionary representing the keys and values from the server’s response header.
ja: サーバーの持つ応答ヘッダからのキーと値を表している辞書。

source: A dictionary with the attributes of the directory at which enumeration started.
ja: そこで列挙が始まったあるディレクトリの属性を持つ辞書。

source: A dictionary with the attributes of the most recently returned file or subdirectory (as referenced by the pathname).
ja: 最も新しく返される（バス名によって参照される）ファイルまたは下位ディレクトリの属性を持つ辞書。

source: A dictionary with the keys from the bundle’s localized property list.
ja: バンドルの持つローカライズプロパティリストからのキーを持つ辞書。

source: A dictionary you use to customize the decoding process by providing contextual information.
ja: デコーディング過程を文脈情報を提供することによってカスタマイズするためにあなたが使う辞書。

source: A dictionary you use to customize the encoding process by providing contextual information.
ja: エンコーディング過程を文脈情報を提供することによってカスタマイズするためにあなたが使う辞書。

source: A dictionary, constructed from the bundle's Info .plist file, that contains information about the receiver.
ja: ある辞書、バンドルの持つInfo .plistファイルから組み立てられます、それはレシーバについての情報を含んでいます。

source: A double-precision, floating-point value type.
ja: 倍精度、浮動小数点値型。

source: A dynamic byte buffer that bridges to Data; use NSMutable Data when you need reference semantics or other Foundation-specific behavior.
ja: 動的バイトバッファ、それはDataにブリッジします；NSMutableを、あなたが参照意味論または他のFoundation特有の挙動を必要とする場合に使ってください。

source: A dynamic plain-text Unicode string object, for use instead of a String variable in cases that require reference semantics.
ja: 動的なプレーンテキストユニコード文字列オブジェクト、参照意味論を必要とする場合にString変数の代わりに使うため。

source: A dynamic, ordered collection of unique objects.
ja: 固有のオブジェクトからなる動的な、順番付きコレクション。

source: A file URL specifying the file or directory to remove.
ja: 除去するファイルまたはディレクトリを指定しているファイルURL。

source: A file URL that specifies the directory to create.
ja: 作成するディレクトリを指定するファイルURL。

source: A file handle associated with a null device.
ja: nullデバイスと結び付けられたファイルハンドル。

source: A file handle initialized with file Descriptor.
ja: file Descriptorで初期化されるファイルハンドル。

source: A file manager object is typically your primary mode of interaction with the file system.
ja: ファイルマネージャオブジェクトは、一般的にファイルシステムとのやりとりのあなたの主要なモードです。

source: A file path.
ja: ファイルパス。

source: A file system node is a file, directory, or symbolic link.
ja: ファイルシステムノードは、ファイル、ディレクトリ、またはシンボリックリンクです。

source: A file wrapper has these attributes:
ja: ファイルラッパーは、これらの属性を持ちます：

source: A final hard return is added to the error message if one is not present in the format.
ja: 末尾のハードリターンは、エラーメッセージに加えられます、もしそれがフォーマットの中に存在しないならば。

source: A flattened view of the elements of this collection of collections.
ja: 複数コレクションからなるこのコレクションの要素を平坦に見たもの。

source: A format style for the date.
ja: 日付に対する書式設定スタイル。

source: A format style for the time.
ja: 時刻に対する書式設定スタイル。

source: A formatted string representing the specified date information.
ja: 指定された日付情報を表している、ある書式設定された文字列。

source: A formatted string representing the specified date interval.
ja: 指定された日付間隔を表している書式設定された文字列。

source: A formatted string representing the specified time information.
ja: 指定された時間情報を表している書式設定済み文字列。

source: A formatted string representing the specified time interval.
ja: 指定された時間間隔を表している書式設定された文字列。

source: A formatter that converts a byte count value into a localized description that is formatted with the appropriate byte modifier (KB, MB, GB and so on).
ja: あるフォーマッタ、それは、バイト計数値をローカライズされた記述へ変換します、それは適切なバイト修飾子（KB、MB、GBなど）で書式化されます。

source: A formatter that converts between dates and their IOS 8601 string representations.
ja: 日付とそれらのIOS 8601文字列表現の間で変換をするフォーマッタ。

source: A formatter that converts between dates and their textual representations.
ja: 日付とそれらのテキスト表現の間で変換をするフォーマッタ。

source: A formatter that converts between numeric values and their textual representations.
ja: 数値とそれらのテキスト表現の間で変換するフォーマッタ。

source: A formatter that creates string representations of quantities of time.
ja: 一定量の時間の文字列表現を作成するフォーマッタ。

source: A formatter that creates string representations of time intervals.
ja: 時間間隔の文字列表現を作成するフォーマッタ。

source: A formatter that provides localized descriptions of energy values.
ja: ローカライズされたエネルギー値の記述を提供するフォーマッタ。

source: A formatter that provides localized descriptions of linear distances, such as length and height measurements.
ja: 直線距離、例えば長さおよび高さ寸法のローカライズされた記述を提供するフォーマッタ。

source: A formatter that provides localized descriptions of mass and weight values.
ja: ローカライズされた容積および重量値の記述を提供するフォーマッタ。

source: A formatter that provides localized representations of the components of a person’s name.
ja: ある個人の名前の構成要素のローカライズされた表現を提供するフォーマッタ。
